{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 5,
      "content": "[BOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 6,
      "content": "[EOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "WhitespaceSplit"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": {
      "[PAD]": 0,
      "[UNK]": 1,
      "[CLS]": 2,
      "[MASK]": 3,
      "[SEP]": 4,
      "[BOS]": 5,
      "[EOS]": 6,
      "(": 7,
      ")": 8,
      "[cH;R;CC]": 9,
      "[n;R;CC]": 10,
      "[c;R;NNN]": 11,
      "2": 12,
      "[NH;!R;CC]": 13,
      "1": 14,
      "3": 15,
      "[c;R;CCC]": 16,
      "=": 17,
      "[c;R;CCN]": 18,
      "[O;!R;C]": 19,
      "[CH2;R;CC]": 20,
      "[CH2;!R;CN]": 21,
      "[C;!R;CNO]": 22,
      "[NH;!R;CDy]": 23,
      "[Dy;!R;N]": 24,
      "[cH;R;CN]": 25,
      "[CH3;!R;C]": 26,
      "[F;!R;C]": 27,
      "4": 28,
      "[CH2;!R;CC]": 29,
      "[CH2;R;CN]": 30,
      "[O;!R;CC]": 31,
      "[c;R;CNN]": 32,
      "[Cl;!R;C]": 33,
      "[c;R;CCF]": 34,
      "[c;R;CCO]": 35,
      "[CH3;!R;O]": 36,
      "[CH2;R;CO]": 37,
      "[N;R;CCC]": 38,
      "[n;R;CN]": 39,
      "[c;R;CCCl]": 40,
      "[s;R;CC]": 41,
      "[CH;R;CCC]": 42,
      "[O;R;CC]": 43,
      "[Br;!R;C]": 44,
      "[c;R;CCS]": 45,
      "[CH2;!R;CO]": 46,
      "[[C@@H];!R;CCN]": 47,
      "[c;R;BrCC]": 48,
      "[CH3;!R;N]": 49,
      "[OH;!R;C]": 50,
      "[[C@H];!R;CCN]": 51,
      "[c;R;CNO]": 52,
      "[O;!R;S]": 53,
      "[C;!R;COO]": 54,
      "[cH;R;CS]": 55,
      "[c;R;CClN]": 56,
      "#": 57,
      "-": 58,
      "[nH;R;CC]": 59,
      "[n;R;CCN]": 60,
      "[[O-];!R;N]": 61,
      "[c;R;NNS]": 62,
      "[[N+];!R;COO]": 63,
      "[O;!R;N]": 64,
      "[C;!R;CN]": 65,
      "[N;!R;C]": 66,
      "[cH;R;NN]": 67,
      "5": 68,
      "[n;R;CCC]": 69,
      "[C;!R;CFFF]": 70,
      "[C;R;CNO]": 71,
      "[nH;R;CN]": 72,
      "[o;R;CC]": 73,
      "[c;R;CNS]": 74,
      "[CH;!R;CCN]": 75,
      "[CH;R;CCO]": 76,
      "[CH3;!R;S]": 77,
      "[CH;!R;CC]": 78,
      "[[C@H];R;CCN]": 79,
      "[CH2;!R;CS]": 80,
      "[[C@@H];R;CCN]": 81,
      "[C;R;CCCC]": 82,
      "[CH2;R;CS]": 83,
      "[CH;R;CCN]": 84,
      "[C;R;CCCO]": 85,
      "[C;!R;CCCO]": 86,
      "[n;R;CO]": 87,
      "[c;R;NNO]": 88,
      "[CH2;!R;C]": 89,
      "[[C@H];R;CCC]": 90,
      "[CH;!R;CCO]": 91,
      "[C;R;CCCN]": 92,
      "[NH;R;CC]": 93,
      "[c;R;CCI]": 94,
      "[I;!R;C]": 95,
      "[o;R;CN]": 96,
      "[C;!R;CC]": 97,
      "[CH;R;CC]": 98,
      "[cH;R;CO]": 99,
      "[n;R;NN]": 100,
      "[S;!R;CC]": 101,
      "[S;!R;CNOO]": 102,
      "[CH;!R;C]": 103,
      "[NH2;!R;C]": 104,
      "[[C@@H];R;CCC]": 105,
      "[N;!R;CCC]": 106,
      "[S;!R;CCOO]": 107,
      "[CH;!R;CCC]": 108,
      "[S;R;CC]": 109,
      "[c;R;BrCN]": 110,
      "[c;R;CFN]": 111,
      "/": 112,
      "[C;!R;CCCC]": 113,
      "[C;!R;NOO]": 114,
      "[[C@@H];R;CCO]": 115,
      "[c;R;ClNN]": 116,
      "[S;!R;CCO]": 117,
      "[NH;!R;CS]": 118,
      "[C;!R;CCFF]": 119,
      "[N;R;CCS]": 120,
      "[cH;R;NO]": 121,
      "[n;R;CS]": 122,
      "[CH;!R;CFF]": 123,
      "[[C@H];R;CCO]": 124,
      "[s;R;CN]": 125,
      "[C;!R;CCO]": 126,
      "[CH;!R;CCS]": 127,
      "[cH;R;NS]": 128,
      "6": 129,
      "[c;R;BrCS]": 130,
      "[C;!R;FFFO]": 131,
      "[C;R;CCFF]": 132,
      "[C;R;CCO]": 133,
      "[C;R;CCOO]": 134,
      "[C;R;CCN]": 135,
      "[CH2;R;OO]": 136,
      "[C;!R;CCCN]": 137,
      "[CH;!R;FFO]": 138,
      "[C;R;NNO]": 139,
      "[C;R;CCC]": 140,
      "[C;R;CCCF]": 141,
      "[C;!R;NNO]": 142,
      "[CH3;!R;Si]": 143,
      "[S;R;CCOO]": 144,
      "[CH;!R;FFN]": 145,
      "[C;R;CCCS]": 146,
      "[S;!R;CS]": 147,
      "[C;!R;CCC]": 148,
      "[N;!R;CCO]": 149,
      "[O;!R;CN]": 150,
      "[CH;R;CCS]": 151,
      "[S;R;CNOO]": 152,
      "[O;R;BC]": 153,
      "[O;R;CN]": 154,
      "[c;R;NSS]": 155,
      "[CH;!R;CO]": 156,
      "[[C@@H];!R;CCO]": 157,
      "[n;R;NS]": 158,
      "[CH;R;CNN]": 159,
      "[CH2;R;NS]": 160,
      "[[C@@];R;CCCN]": 161,
      "[N;!R;CN]": 162,
      "[[N+];!R;NN]": 163,
      "[[N-];!R;N]": 164,
      "[[C@@];!R;CCCN]": 165,
      "[SH;!R;C]": 166,
      "[C;R;COO]": 167,
      "[s;R;NN]": 168,
      "[c;R;ClNS]": 169,
      "[CH2;!R;OO]": 170,
      "[N;R;CO]": 171,
      "[C;!R;COS]": 172,
      "[C;!R;CClCl]": 173,
      "[C;!R;CCOO]": 174,
      "[nH;R;NN]": 175,
      "[CH;!R;BrC]": 176,
      "[CH2;!R;CF]": 177,
      "[N;!R;CCS]": 178,
      "[C;!R;CNN]": 179,
      "[NH;!R;C]": 180,
      "[C;!R;CCCl]": 181,
      "[NH2;!R;S]": 182,
      "[[C@];R;CCCN]": 183,
      "[c;R;NOS]": 184,
      "[C;R;NNS]": 185,
      "[N;R;CC]": 186,
      "[CH;R;CSS]": 187,
      "[C;R;NOS]": 188,
      "[C;R;CCS]": 189,
      "[C;R;NOO]": 190,
      "[c;R;BCC]": 191,
      "[B;R;COO]": 192,
      "[c;R;COS]": 193,
      "[c;R;COO]": 194,
      "[C;!R;CSi]": 195,
      "[Si;!R;CCCC]": 196,
      "[[n+];R;CCO]": 197,
      "[CH;R;CNO]": 198,
      "[S;R;CCO]": 199,
      "[N;R;CCO]": 200,
      "7": 201,
      "[[C@H];!R;CCO]": 202,
      "[n;R;CNN]": 203,
      "[S;!R;C]": 204,
      "[N;R;CCN]": 205,
      "[N;R;CN]": 206,
      "[c;R;FNN]": 207,
      "[c;R;CClS]": 208,
      "[o;R;NN]": 209,
      "[[C@H];R;CCF]": 210,
      "[[C@@H];R;CCF]": 211,
      "8": 212,
      "[[C@];!R;CCCN]": 213,
      "9": 214
    },
    "unk_token": "[UNK]"
  }
}